app/controllers/people_controller.rb

INSERT INTO `people` (`updated_at`, `first_name`, `last_name`, `created_at`) VALUES('2009-07-08 13:55:11', 'person', 'new', '2009-07-08 13:55:11')
SELECT * FROM `people`
---
  def sync_up_from_gears
    # parse the json holding all the local people
     unless params[:people].nil?
       people = JSON.parse(params[:people])

       # current people prior to sycn
       existing_ids = []
       Person.find(:all).each{|p| existing_ids << p.id}

       local_remote_ids =[]
       people.each{|p| local_remote_ids << p['remoteid'] unless p['remoteid'].blank?}